MMMZZZZ/Random-Stuff/TI/TivaWare_C_Series-2.2.0.295/examples/boards/ek-tm4c1294xl/hibernate_calendar/hibernate_calendar.c
}
//*****************************************************************************
//
// This example demonstrates the different hibernate wake sources.  The
// microcontroller is put into hibernation by the user and wakes up based on
// timeout or one of the user inputs.  This example also demonstrates the RTC
// calendar function that keeps track of date and time.
//
//*****************************************************************************
int
main(void)
{
    bool bUpdate;
    uint32_t ui32SysClock, ui32Status, ui32HibernateCount, ui32Len;
    int32_t i32CmdStatus;

    //
    // Run from the PLL at 120 MHz.
    // Note: SYSCTL_CFG_VCO_240 is a new setting provided in TivaWare 2.2.x and
    // later to better reflect the actual VCO speed due to SYSCTL#22.
    //
    ui32SysClock = MAP_SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |
                                           SYSCTL_OSC_MAIN |
                                           SYSCTL_USE_PLL |
                                           SYSCTL_CFG_VCO_240), 120000000);

    //
    // Configure the device pins.
    //
    PinoutSet(false, false);

    //
    // Enable UART0
    //
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);

    //
    // Initialize the UART for console I/O.
    //
    UARTStdioConfig(0, 115200, ui32SysClock);

    //
    // Enable the hibernate module.
    //
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_HIBERNATE);

    //
    // Initialize these variables before they are used.
    //
    ui32Status = 0;
    ui32HibernateCount = 0;

    //
    // Check to see if Hibernation module is already active, which could mean
    // that the processor is waking from a hibernation.
    //
    if(HibernateIsActive())
    {
        //
        // Read the status bits to see what caused the wake.  Clear the wake
        // source so that the device can be put into hibernation again.
        //
        ui32Status = MAP_HibernateIntStatus(0);
        MAP_HibernateIntClear(ui32Status);

        //
        // Store the common part of the wake information message into a buffer.
        // The wake source will be appended based on the status bits.
        //
        ui32Len = usnprintf(g_pcWakeBuf, sizeof(g_pcWakeBuf),
                            "Wake Due To : ");

        //
        // Wake was due to RTC match.
        //
        if(ui32Status & HIBERNATE_INT_RTC_MATCH_0)
        {
            ui32Len = usnprintf(&g_pcWakeBuf[ui32Len],
                                sizeof(g_pcWakeBuf) - ui32Len, "%s",
                                g_ppcWakeSource[0]);
        }

        //
        // Wake was due to Reset button.
        //
        else if(ui32Status & HIBERNATE_INT_RESET_WAKE)
        {
            ui32Len = usnprintf(&g_pcWakeBuf[ui32Len],
                                sizeof(g_pcWakeBuf) - ui32Len, "%s",
                                g_ppcWakeSource[1]);
        }

        //
        // Wake was due to the External Wake pin.
        //
        else if(ui32Status & HIBERNATE_INT_PIN_WAKE)
        {
            ui32Len = usnprintf(&g_pcWakeBuf[ui32Len],
                                sizeof(g_pcWakeBuf) - ui32Len, "%s",
                                g_ppcWakeSource[2]);
        }

        //
        // Wake was due to GPIO wake.
        //
        else if(ui32Status & HIBERNATE_INT_GPIO_WAKE)
        {
            ui32Len = usnprintf(&g_pcWakeBuf[ui32Len],
                                sizeof(g_pcWakeBuf) - ui32Len, "%s",
                                g_ppcWakeSource[3]);
        }

        //
        // If the wake is due to any of the configured wake sources, then read
        // the first location from the battery-backed memory, as the
        // hibernation count.
        //
        if(ui32Status & (HIBERNATE_INT_PIN_WAKE | HIBERNATE_INT_RTC_MATCH_0 |
                         HIBERNATE_INT_GPIO_WAKE | HIBERNATE_INT_RESET_WAKE))
        {
            MAP_HibernateDataGet(&ui32HibernateCount, 1);
        }
    }

    //
    // Configure Hibernate module clock.
    //
    MAP_HibernateEnableExpClk(ui32SysClock);

    //
    // If the wake was not due to the above sources, then it was a system
    // reset.
    //
    if(!(ui32Status & (HIBERNATE_INT_PIN_WAKE | HIBERNATE_INT_RTC_MATCH_0 |
                       HIBERNATE_INT_GPIO_WAKE | HIBERNATE_INT_RESET_WAKE)))
    {
        //
        // Configure the module clock source.
        //
        MAP_HibernateClockConfig(HIBERNATE_OSC_LOWDRIVE);

        //
        // Store that this was a system restart not wake from hibernation.
        //
        ui32Len = usnprintf(g_pcWakeBuf, sizeof(g_pcWakeBuf), "%s",
                            g_ppcWakeSource[4]);

        //
        // Set flag to indicate we need a valid date.  Date will then be set
        // in the while(1) loop.
        //
        g_bSetDate = true;
    }

    //
    // Store the hibernation count message into the respective char buffer.
    //
    usnprintf(g_pcHibBuf, sizeof(g_pcHibBuf), "Hibernate count = %u",
              ui32HibernateCount);

    //
    // Enable RTC mode.
    //
    MAP_HibernateRTCEnable();

    //
    // Configure the hibernate module counter to 24-hour calendar mode.
    //
    MAP_HibernateCounterMode(HIBERNATE_COUNTER_24HR);

    //
    // Configure GPIOs used as Hibernate wake source.  PK6 is configured as a
    // wake source.  It is available on EK-TM4C1294XL BoosterPack 2 (X7-17)
    // and on the breadboard breakout connector (X11-63).  Short to ground to
    // generate a wake request.
    //
    MAP_GPIOPadConfigSet(GPIO_PORTK_BASE, GPIO_PIN_6, GPIO_STRENGTH_2MA,
                         (GPIO_PIN_TYPE_WAKE_LOW | GPIO_PIN_TYPE_STD_WPU));

    //
    // Initialize the buttons
    //
    ButtonsInit();

    //
    // Initialize the SysTick interrupt to process user buttons.
    //
    MAP_SysTickPeriodSet(SysCtlClockGet() / 30);
    MAP_SysTickEnable();
    MAP_SysTickIntEnable();

    //
    // Enable processor interrupts.
    //
    MAP_IntMasterEnable();

    //
    // If hibernation count is very large, it may be that there was already
    // a value in the hibernate memory, so reset the count.
    //
    ui32HibernateCount = (ui32HibernateCount > 10000) ? 0 : ui32HibernateCount;

    //
    // Initialize the necessary flags before entering indefinite loop.
    //
    g_bHibernate = false;

    //
    // Clear the terminal and print the banner.
    //
    UARTprintf("\033[2J\033[H");
    UARTprintf("%s\n", g_pcWakeBuf);
    UARTprintf("Welcome to the Tiva C Series TM4C1294 LaunchPad!\n");
    UARTprintf("Hibernation Example\n");
    UARTprintf("Type 'help' for a list of commands\n");
    UARTprintf("> ");
    UARTFlushTx(false);

    //
    // Set flag that next update is the first ever.
    // This triggers a screen clear on next update.
    //
    g_bFirstUpdate = true;
    g_ui8FirstLine = 5;

    //
    // Loop forever.
    //
    while(1)
    {
        //
        // Check the flag which indicates that an invalid time is in hibernate
        // module.  If set then force setting to the default time.
        //
        if(g_bSetDate)
        {
            //
            // Clear the flag.
            //
            g_bSetDate = false;

            //
            // Set the date to the default values and commit it to the
            // hibernate module.
            //
            DateTimeDefaultSet();
            DateTimeSet();
        }

        //
        // Update the buffer that displays date and time on the main
        // screen.
        //
        bUpdate = DateTimeDisplayGet(g_pcDateTimeBuf,
                                     sizeof(g_pcDateTimeBuf));

        //
        // Is a new value of date and time available to be displayed?
        //
        if(bUpdate == true)
        {
            //
            // Check if this is first ever update.
            //
            if(g_bFirstUpdate == false)
            {
                //
                // Save current cursor position.
                //
                UARTprintf("\033[s");
            }

            //
            // Resend the current status and time.
            //
            UARTprintf("\033[%d;1H\033[K", g_ui8FirstLine);
            UARTprintf("The current date and time is: %s\n", g_pcDateTimeBuf);
            UARTprintf("\033[K");
            UARTprintf("%s\n", g_pcHibBuf);
            UARTprintf("\033[K");
            UARTprintf("To Hibernate type 'hib' and press ENTER or press "
                       "USR_SW1\n");

            //
            // Check if this is first ever update.
            //
            if(g_bFirstUpdate == false)
            {
                //
                // Restore cursor position.
                //
                UARTprintf("\033[u");

