MMMZZZZ/Random-Stuff/TI/TivaWare_C_Series-2.2.0.295/examples/boards/ek-tm4c1294xl/hibernate_calendar/hibernate_calendar.c
            }
            else
            {
                UARTprintf(">");
            }

            //
            // Flush the TX Buffer.
            //
            UARTFlushTx(false);

            //
            // Clear the first update flag.
            //
            g_bFirstUpdate = false;

        }

        //
        // Check if a carriage return is present in the UART Buffer.
        //
        if(UARTPeek('\r') != -1)
        {
            //
            // A '\r' was detected, so get the line of text from the user.
            //
            UARTgets(g_pcInputBuf,sizeof(g_pcInputBuf));

            //
            // Pass the line from the user to the command processor.
            // It will be parsed and valid commands executed.
            //
            i32CmdStatus = CmdLineProcess(g_pcInputBuf);

            //
            // Handle the case of bad command.
            //
            if(i32CmdStatus == CMDLINE_BAD_CMD)
            {
                UARTprintf("Command not recognized!\n");
            }

            //
            // Handle the case of too many arguments.
            //
            else if(i32CmdStatus == CMDLINE_TOO_MANY_ARGS)
            {
                UARTprintf("Too many arguments for command processor!\n");
            }

            //
            // Handle the case of too few arguments.
            //
            else if(i32CmdStatus == CMDLINE_TOO_FEW_ARGS)
            {
                UARTprintf("Too few arguments for command processor!\n");
            }

            UARTprintf(">");
        }

        //
        // Check if user wants to enter hibernation.
        //
        if(g_bHibernate == true)
        {
            //
            // Increment the hibernation count, and store it in the
            // battery-backed memory.
            //
            ui32HibernateCount++;
            MAP_HibernateDataSet(&ui32HibernateCount, 1);

            //
            // Yes - Clear the flag.
            //
            g_bHibernate = false;
            AppHibernateEnter();
        }
    }
}
